Revit 2027 API
UV.Add Method
Adds the specified 2-D vector to this 2-D vector and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Add(
	UV source
)
Public Function Add (
	source As UV
) As UV
public:
UV^ Add(
	UV^ source
)
member Add :
        source : UV -> UV
Parameters
source UV
The vector to add to this vector.
Return Value
UV
The 2-D vector equal to the sum of the two vectors.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The added vector is obtained by adding each coordinate of the specified vector to the corresponding coordinate of this vector.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace